app/controllers/skills_controller.rb

SELECT "skills".* FROM "skills"   ORDER BY title ASC
---
  def index
    @skills = Skill.order('title ASC')

INSERT INTO "skills" ("created_at", "title", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-08-07 22:04:09.681785"], ["title", "Web Development"], ["updated_at", "2014-08-07 22:04:09.681785"]]
---
  def create
    @skill = Skill.new(skill_params)

    respond_to do |format|
      if @skill.save