app/controllers/tools_controller.rb

  def index
    @tools = Tool.all
---
SELECT "tools".* FROM "tools"   ORDER BY title ASC

  def create
    @tool = Tool.new(tool_params)

    respond_to do |format|
      if @tool.save
---
INSERT INTO "tools" ("created_at", "title", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-08-07 22:04:29.794895"], ["title", "Computer Mouse"], ["updated_at", "2014-08-07 22:04:29.794895"]]

    def set_tool
      @tool = Tool.find(params[:id])
---
SELECT  "tools".* FROM "tools"  WHERE "tools"."id" = $1 LIMIT 1  [["id", 1]]